[{"key":"-1","parent":"","name":"Lee has demonstrated that he was prejudiced by his counsel's erroneous advice. Pp. 5-13.","type":null},{"key":"0","parent":"-1","name":"Defendant","type":null},{"key":"00","parent":"0","name":"(a) When a defendant claims that his counsel's deficient performance deprived him of a trial by causing him to accept a plea, the defendant can show prejudice by demonstrating a \"reasonable probability that, but for counsel's errors, he would not have pleaded guilty and would have insisted on going to trial.\"","type":null},{"key":"001","parent":"00","name":"Hill v. Lockhart, 474 U. S. 52, 59.","type":"red"},{"key":"002","parent":"00","name":"Lee contends that he can make this showing because he never would have accepted a guilty plea had he known the result would be deportation.","type":null},{"key":"003","parent":"002","name":"The Government contends that Lee cannot show prejudice from accepting a plea where his only hope at trial was that something unexpected and unpredictable might occur that would lead to acquittal.","type":null},{"key":"004","parent":"003","name":"First, it forgets that categorical rules are ill suited to an inquiry that demands a \"case-by-case examination\" of the \"totality of the evidence.\"","type":null},{"key":"005","parent":"004","name":"Williams v. Taylor, 529 U. S. 362, 391 (internal quotation marks omitted); Strickland, 466 U. S., at 695.","type":"red"},{"key":"006","parent":"00","name":"When those consequences are, from the defendant's perspective, similarly dire, even the smallest chance of success at trial may look attractive.","type":null},{"key":"007","parent":"00","name":"For Lee, deportation after some time in prison was not meaningfully different from deportation after somewhat less time; he says he accordingly would have rejected any plea leading to deportation in favor of throwing a \"Hail Mary\" at trial.","type":null},{"key":"1","parent":"-1","name":"Government","type":null},{"key":"10","parent":"1","name":"(b) The Government makes two errors in urging the adoption of a per se rule that a defendant with no viable defense cannot show prejudice from the denial of his right to trial.","type":null},{"key":"101","parent":"10","name":"First, it forgets that categorical rules are ill suited to an inquiry that demands a \"case-by-case examination\" of the \"totality of the evidence.\"","type":null},{"key":"102","parent":"101","name":"Williams v. Taylor, 529 U. S. 362, 391 (internal quotation marks omitted); Strickland, 466 U. S., at 695.","type":"red"},{"key":"103","parent":"10","name":"When those consequences are, from the defendant's perspective, similarly dire, even the smallest chance of success at trial may look attractive.","type":null},{"key":"104","parent":"10","name":"For Lee, deportation after some time in prison was not meaningfully different from deportation after somewhat less time; he says he accordingly would have rejected any plea leading to deportation in favor of throwing a \"Hail Mary\" at trial.","type":null},{"key":"11","parent":"1","name":"Pointing to Strickland, the Government urges that \"[a] defendant has no entitlement to the luck of a lawless decisionmaker.\"","type":null},{"key":"111","parent":"11","name":"466 U. S., at 695.","type":null},{"key":"112","parent":"111","name":"That statement, however, was made in the context of discussing the presumption of reliability applied to judicial proceedings, which has no place where, as here, a defendant was deprived of a proceeding altogether.","type":null},{"key":"113","parent":"11","name":"When the inquiry is focused on what an individual defendant would have done, the possibility of even a highly improbable result may be pertinent to the extent it would have affected the defendant's decisionmaking.","type":null},{"key":"114","parent":"11","name":"In the unusual circumstances of this case, Lee has adequately demonstrated a reasonable probability that he would have rejected the plea had he known that it would lead to mandatory deportation: Both Lee and his attorney testified that \"deportation was the determinative issue\" to Lee; his responses during his plea colloquy confirmed the importance he placed on deportation; and he had strong connections to the United States, while he had no ties to South Korea.","type":null},{"key":"115","parent":"114","name":"The Government argues that Lee cannot \"convince the court that a decision to reject the plea bargain would have been rational under the circumstances,\" Padilla v. Kentucky, 559 U. S. 356, 372, since deportation would almost certainly result from a trial.","type":"red"}]